{
  "documentSentiment": {
    "magnitude": 5.4,
    "score": 0.1
  },
  "language": "en",
  "sentences": [
    {
      "sentiment": {
        "magnitude": 0.8,
        "score": 0.8
      },
      "text": {
        "beginOffset": 0,
        "content": "The city of Sevilla is proving there is more than just one type of juice you can produce from oranges."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.0,
        "score": 0.0
      },
      "text": {
        "beginOffset": 103,
        "content": "In a new pilot scheme, the southern Spanish city will start producing electricity from leftover oranges by capturing the methane from the fermented fruits and using it to drive a generator."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.3,
        "score": 0.3
      },
      "text": {
        "beginOffset": 294,
        "content": "Sevilla is famous for having streets and parks lined with orange trees."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.0,
        "score": 0.0
      },
      "text": {
        "beginOffset": 366,
        "content": "In fact, the city’s 48,000 orange trees deposit some 5.7 million kilos of the fruit each year."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.5,
        "score": -0.5
      },
      "text": {
        "beginOffset": 463,
        "content": "While some of these oranges are used to make local liquors, a big fraction of the bitter oranges winds up dropping on the streets and attracting flies, creating a headache for the city’s cleaning department."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.5,
        "score": -0.5
      },
      "text": {
        "beginOffset": 674,
        "content": "To make use of this wasted fruit, the city will collect oranges off the streets and bring them to an existing facility that already generates power from organic matter."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.3,
        "score": 0.3
      },
      "text": {
        "beginOffset": 843,
        "content": "Through this, the city hopes to generate enough clean energy to power its water purification plants."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.5,
        "score": 0.5
      },
      "text": {
        "beginOffset": 945,
        "content": "“The juice is fructose made up of very short carbon chains and the energetic performance of these carbon chains during the fermentation process is very high,” said Benigno López, head of Emasesa, the municipal water company."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.0,
        "score": 0.0
      },
      "text": {
        "beginOffset": 1175,
        "content": "“It’s not just about saving money."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.1,
        "score": 0.1
      },
      "text": {
        "beginOffset": 1214,
        "content": "The oranges are a problem for the city and we’re producing added value from waste.”"
      }
    },
    {
      "sentiment": {
        "magnitude": 0.5,
        "score": 0.5
      },
      "text": {
        "beginOffset": 1303,
        "content": "From trials, researchers have found that 1,000kg can produce 50kWh, which is enough to provide electricity to five homes for one day."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.0,
        "score": 0.0
      },
      "text": {
        "beginOffset": 1437,
        "content": "Although the initial plan is to use the energy to run the water purification plants, the city eventually wants to feed the orange-produced electricity into the grid."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.3,
        "score": -0.3
      },
      "text": {
        "beginOffset": 1604,
        "content": "Sevilla’s bitter oranges originate in Asia and were introduced by the Arabs around 1,000 years ago."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.8,
        "score": 0.8
      },
      "text": {
        "beginOffset": 1706,
        "content": "According to the head of the city’s parks department, Fernando Mora Figueroa, they have adapted well to the southern Spanish climate and are resistant to pollution."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.1,
        "score": -0.1
      },
      "text": {
        "beginOffset": 1873,
        "content": "“People say the city of Seville is the world’s largest orange grove.”"
      }
    }
  ]
}
