{
  "documentSentiment": {
    "magnitude": 4.4,
    "score": 0.0
  },
  "language": "en",
  "sentences": [
    {
      "sentiment": {
        "magnitude": 0.4,
        "score": -0.4
      },
      "text": {
        "beginOffset": 0,
        "content": "Anyone who has experienced a migraine knows how debilitating the pain can be."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.8,
        "score": 0.8
      },
      "text": {
        "beginOffset": 78,
        "content": "And while there are several medicinal ways to help alleviate migraine symptoms, a recent study has found that getting enough exercise might just do the trick."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.4,
        "score": 0.4
      },
      "text": {
        "beginOffset": 238,
        "content": "While exercise has long been known to help reduce migraine triggers, the new research from the University of Washington has found that just two-and-a-half hours of exercise a week can be especially effective with triggers such as stress, depression, and trouble sleeping."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.3,
        "score": 0.3
      },
      "text": {
        "beginOffset": 511,
        "content": "“It’s a complex relationship, but we know that exercise, generally speaking, helps increase levels of good neurotransmitters, like dopamine, norepinephrine, serotonin, which contribute to not only fewer headaches but also better mood and overall well-being,” said study author Dr. Mason Dyess."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.0,
        "score": 0.0
      },
      "text": {
        "beginOffset": 812,
        "content": "As part of the study, the researchers surveyed more than 4,600 diagnosed with migraines."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.5,
        "score": -0.5
      },
      "text": {
        "beginOffset": 901,
        "content": "About 75 percent had 15 or more migraines a month while the other 25 percent had 14 or fewer."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.0,
        "score": 0.0
      },
      "text": {
        "beginOffset": 995,
        "content": "Each participant completed a questionnaire about their migraine characteristics, sleep routines, depression, stress, and anxiety."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.2,
        "score": 0.2
      },
      "text": {
        "beginOffset": 1125,
        "content": "And they also reported how much exercise they got each week."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.1,
        "score": -0.1
      },
      "text": {
        "beginOffset": 1187,
        "content": "Researchers then divided participants into five groups by frequency of exercise ranging from none to more than 150 minutes (two-and-a-half-hours) per week — the minimum recommended by the World Health Organization (WHO)."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.7,
        "score": -0.7
      },
      "text": {
        "beginOffset": 1411,
        "content": "The results showed that only 27 percent of participants exercised more than 150 minutes per week, while those who exercised less than that reported increased rates of depression, anxiety, and sleep problems."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.0,
        "score": 0.0
      },
      "text": {
        "beginOffset": 1620,
        "content": "What’s more, almost half of the participants who did not exercise had depression, compared to a quarter of people in the group that exercised the most."
      }
    },
    {
      "sentiment": {
        "magnitude": 0.6,
        "score": -0.6
      },
      "text": {
        "beginOffset": 1774,
        "content": "Four in 10 people who did not exercise also had anxiety, compared to only 28 percent of the group exercising the most."
      }
    }
  ]
}
